import { ForumCard } from '@/entities/ForumCard/ui/ForumCard'
import classes from './Forums.module.scss'

const info = {
  phone: '+996500500500',
  email: '@urban.kg',
  address: 'Бишкек , Улица, Дом',
  social: [
    {
      url: '',
      name: 'канал',
    },
    {
      url: '',
      name: 'Ссылка на канал - "Название канала"',
    },
    {
      url: '',
      name: 'Ссылка на канал - "Название канала по абв и где"',
    },
  ],
}

const text = "URBAN SPACE - инновационная цифровая платформа для развития и улучшения городской и сельской среды Кыргызстана. Мы создаем интерактивное пространство, где молодые специалисты в области информационных технологий, урбанистики, архитектуры, экологии и активисты могут обмениваться идеями, разрабатывать продукты и проекты, а также вовлекать заинтересованные стороны в их реализацию. Платформа объединяет экспертизу, творчество и технологии для создания современных, комфортных и устойчивых городов и населённых пунктов. \n\n URBAN SPACE объединяет ключевые инструменты для развития городской и сельской среды: Банк урбан-идей — цифровая база инновационных проектов, включая архитектурные концепции, транспортные модели, умные технологии и экологические инициативы. Этот модуль позволяет делиться идеями и воплощать их в жизнь. \n\n Урбан-статьи - аналитические материалы, исследования, успешные кейсы и экспертные мнения по устойчивому развитию городов и населённых пунктов. Модуль помогает специалистам и жителям принимать информированные решения. \n\n Краудсорсинг-сбор предложений от жителей для выявления и решения актуальных проблем городской и сельской среды. \n\n Краудфандинг -привлечение средств для реализации актуальных идей и проектов на платформе. \n\n на страницу урбан сколар: Читайте и вдохновляйтесь! Открывайте новые идеи и лучшие практики для улучшения городской и сельской среды. \n\n на страницу краудсорсинг: Вносите свой вклад в развитие среды! Предлагайте идеи, голосуйте за проекты и участвуйте в решении актуальных городских и сельских вызовов. на страницу краудфандиег Поддерживайте лучшие проекты!"

const paragraphs = text.split(/\n{2,}/).map(p => p.trim()).filter(Boolean)

export default function Forums() {
  return (
    <section className={classes.forums}>
       {paragraphs.map((p, i) => (
        <p className={classes.about} key={i} style={{ marginBottom: '1rem', lineHeight: 1.6 }}>
          {p}
        </p>
      ))}
      <h1 className={classes.forums__title}>Контакты</h1>
      <p className={classes.forums__description}>
        Наши контакты и ссылки на каналы
      </p>
      <div className={classes.forums__links}>
        <p>
          Номер телефона: <br />
          <a href={`tel:${info.phone}`}>{info.phone}</a>
        </p>
        <p>
          Почта: <br />
          <a href={`mailto:${info.email}`}>{info.email}</a>
        </p>
        <p>
          Адрес: <br />
          <span className={classes.forums__links__address}>{info.address}</span>
        </p>
        <div className={classes.forums__links__social}>
          <p>Наши каналы:</p>
          <ul>
            {info.social.map((item, index) => (
              <ForumCard media={item.url} title={item.name} key={index} />
            ))}
          </ul>
        </div>
      </div>
    </section>
  )
}
